src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/heatTransfer/chtMultiRegionFoam/externalCoupledHeater/system/README
- fvSolution is used for outer correctors specification.
- fvSchemes is only so that pre-processing activities can proceed
